Gandalf20/ESP8266-3.1.2/esp8266/boards.txt
#
# Do not create pull-requests for this file only, CI will not accept them.
# You *must* edit/modify/run boards.txt.py to regenerate boards.txt.
# All modified files after running with option "--allgen" must be included in the pull-request.
#

menu.BoardModel=Model
menu.ESPModule=Module
menu.UploadTool=Upload Tool
menu.led=Builtin Led
menu.baud=Upload Speed
menu.xtal=CPU Frequency
menu.CrystalFreq=Crystal Frequency
menu.eesz=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.ResetMethod=Reset Method
menu.dbg=Debug port
menu.lvl=Debug Level
menu.ip=lwIP Variant
menu.vt=VTables
menu.exception=C++ Exceptions
menu.stacksmash=Stack Protection
menu.wipe=Erase Flash
menu.sdk=NONOS SDK Version
menu.ssl=SSL Support
menu.mmu=MMU
menu.non32xfer=Non-32-Bit Access
##############################################################
esp01s.name=ESP01s
esp01s.build.board=ESP8266_01S
esp01s.upload.tool=esptool
esp01s.upload.maximum_data_size=81920
esp01s.upload.wait_for_upload_port=true
esp01s.upload.erase_cmd=
esp01s.serial.disableDTR=true
esp01s.serial.disableRTS=true
esp01s.build.mcu=esp8266
esp01s.build.core=esp8266
esp01s.build.variant=esp01s
esp01s.build.spiffs_pagesize=256
esp01s.build.debug_port=
esp01s.build.debug_level=
esp01s.menu.xtal.80=80 MHz
esp01s.menu.xtal.80.build.f_cpu=80000000L
esp01s.menu.xtal.160=160 MHz
esp01s.menu.xtal.160.build.f_cpu=160000000L
esp01s.menu.vt.flash=Flash
esp01s.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
esp01s.menu.vt.heap=Heap
esp01s.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
esp01s.menu.vt.iram=IRAM
esp01s.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
esp01s.menu.exception.disabled=Disabled (new aborts on oom)
esp01s.menu.exception.disabled.build.exception_flags=-fno-exceptions
esp01s.menu.exception.disabled.build.stdcpp_lib=-lstdc++
esp01s.menu.exception.enabled=Enabled
esp01s.menu.exception.enabled.build.exception_flags=-fexceptions
esp01s.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
esp01s.menu.stacksmash.disabled=Disabled
esp01s.menu.stacksmash.disabled.build.stacksmash_flags=
esp01s.menu.stacksmash.enabled=Enabled
esp01s.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
esp01s.menu.ssl.bearssl=BearSSL
esp01s.menu.ssl.bearssl.build.ssl_lib=-lbearssl
esp01s.menu.ssl.bearssl.build.ssl=-DBEARSSL
esp01s.menu.ssl.mdebtls=MbedTLS (in development)
esp01s.menu.ssl.mdebtls.build.ssl_lib=-lmbedtls
esp01s.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
esp01s.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
esp01s.menu.mmu.3232=32KB cache + 32KB IRAM
esp01s.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
esp01s.menu.mmu.4816=16KB cache + 48KB IRAM
esp01s.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
esp01s.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
esp01s.menu.non32xfer.fast.build.non32xferflags=
esp01s.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
esp01s.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
esp01s.upload.resetmethod=--before default_reset --after hard_reset
esp01s.build.flash_mode=qout
esp01s.build.flash_flags=-DFLASHMODE_QOUT
esp01s.build.flash_freq=40
esp01s.menu.eesz.1M=1MB (NoFS OTA:~500KB EEPROM:8K)
esp01s.menu.eesz.1M.build.flash_size=1M
esp01s.menu.eesz.1M.build.flash_ld=eagle.flash.01s.1m.ld
esp01s.menu.eesz.1M.build.spiffs_pagesize=256
esp01s.menu.eesz.1M.build.rfcal_addr=0xFC000
esp01s.menu.eesz.1M.build.spiffs_start=0xFA000
esp01s.menu.eesz.1M.build.spiffs_end=0xFA000
esp01s.menu.eesz.1M.build.spiffs_blocksize=4096
esp01s.menu.eesz.1M.build.eeprom_start=0xFA000
esp01s.menu.eesz.1M436=1MB (FS:436KB OTA:~500KB STORAGE:32KB EEPROM:8K)
esp01s.menu.eesz.1M436.build.flash_size=1M
esp01s.menu.eesz.1M436.build.flash_ld=eagle.flash.01s.1m436.ld
esp01s.menu.eesz.1M436.build.spiffs_pagesize=256
esp01s.menu.eesz.1M436.build.rfcal_addr=0xFC000
esp01s.menu.eesz.1M436.build.spiffs_start=0x85000
esp01s.menu.eesz.1M436.build.spiffs_end=0xF2000
esp01s.menu.eesz.1M436.build.spiffs_blocksize=4096
esp01s.menu.eesz.1M436.build.eeprom_start=0xFA000
esp01s.menu.eesz.1M468=1MB (FS:468KB OTA:~500KB EEPROM:8K)
esp01s.menu.eesz.1M468.build.flash_size=1M
esp01s.menu.eesz.1M468.build.flash_ld=eagle.flash.01s.1m468.ld
esp01s.menu.eesz.1M468.build.spiffs_pagesize=256
esp01s.menu.eesz.1M468.build.rfcal_addr=0xFC000
esp01s.menu.eesz.1M468.build.spiffs_start=0x85000
esp01s.menu.eesz.1M468.build.spiffs_end=0xFA000
esp01s.menu.eesz.1M468.build.spiffs_blocksize=4096
esp01s.menu.eesz.1M468.build.eeprom_start=0xFA000
esp01s.menu.sdk.nonosdk_190703=nonos-sdk 2.2.1+100 (190703)
esp01s.menu.sdk.nonosdk_190703.build.sdk=NONOSDK22x_190703
esp01s.menu.sdk.nonosdk_191122=nonos-sdk 2.2.1+119 (191122)
esp01s.menu.sdk.nonosdk_191122.build.sdk=NONOSDK22x_191122
esp01s.menu.sdk.nonosdk_191105=nonos-sdk 2.2.1+113 (191105)
esp01s.menu.sdk.nonosdk_191105.build.sdk=NONOSDK22x_191105
esp01s.menu.sdk.nonosdk_191024=nonos-sdk 2.2.1+111 (191024)
esp01s.menu.sdk.nonosdk_191024.build.sdk=NONOSDK22x_191024
esp01s.menu.sdk.nonosdk_190313=nonos-sdk 2.2.1+61 (190313)
esp01s.menu.sdk.nonosdk_190313.build.sdk=NONOSDK22x_190313
esp01s.menu.sdk.nonosdk221=nonos-sdk 2.2.1 (legacy)
esp01s.menu.sdk.nonosdk221.build.sdk=NONOSDK221
esp01s.menu.sdk.nonosdk305=nonos-sdk 3.0.5
esp01s.menu.sdk.nonosdk305.build.sdk=NONOSDK305
esp01s.menu.ip.lm2f=v2 Lower Memory
esp01s.menu.ip.lm2f.build.lwip_include=lwip2/include
esp01s.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
esp01s.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
esp01s.menu.ip.hb2f=v2 Higher Bandwidth
esp01s.menu.ip.hb2f.build.lwip_include=lwip2/include
esp01s.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
esp01s.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
esp01s.menu.ip.lm2n=v2 Lower Memory (no features)
esp01s.menu.ip.lm2n.build.lwip_include=lwip2/include
esp01s.menu.ip.lm2n.build.lwip_lib=-llwip2-536
esp01s.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
esp01s.menu.ip.hb2n=v2 Higher Bandwidth (no features)
esp01s.menu.ip.hb2n.build.lwip_include=lwip2/include
esp01s.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
esp01s.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
esp01s.menu.ip.lm6f=v2 IPv6 Lower Memory
esp01s.menu.ip.lm6f.build.lwip_include=lwip2/include
esp01s.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
esp01s.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
esp01s.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
esp01s.menu.ip.hb6f.build.lwip_include=lwip2/include
esp01s.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
esp01s.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
esp01s.menu.dbg.Disabled=Disabled
esp01s.menu.dbg.Disabled.build.debug_port=
esp01s.menu.dbg.Serial=Serial
esp01s.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
esp01s.menu.dbg.Serial1=Serial1
esp01s.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
esp01s.menu.lvl.None____=None
esp01s.menu.lvl.None____.build.debug_level=
esp01s.menu.lvl.SSL=SSL
esp01s.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
esp01s.menu.lvl.TLS_MEM=TLS_MEM
esp01s.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
esp01s.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
esp01s.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
esp01s.menu.lvl.HTTP_SERVER=HTTP_SERVER
esp01s.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
esp01s.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
esp01s.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
esp01s.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
esp01s.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
esp01s.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
esp01s.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
esp01s.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
esp01s.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
esp01s.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
esp01s.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
esp01s.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
esp01s.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp01s.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
esp01s.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
esp01s.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
esp01s.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
esp01s.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
esp01s.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp01s.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
esp01s.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp01s.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
esp01s.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp01s.menu.lvl.CORE=CORE
esp01s.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
esp01s.menu.lvl.WIFI=WIFI
esp01s.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
esp01s.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
esp01s.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
esp01s.menu.lvl.UPDATER=UPDATER
esp01s.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
esp01s.menu.lvl.OTA=OTA
esp01s.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
esp01s.menu.lvl.OOM=OOM
esp01s.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
esp01s.menu.lvl.MDNS=MDNS
esp01s.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
esp01s.menu.lvl.HWDT=HWDT
esp01s.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
esp01s.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
esp01s.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
esp01s.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
esp01s.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
esp01s.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
esp01s.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
esp01s.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
esp01s.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
esp01s.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
esp01s.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
esp01s.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
esp01s.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
esp01s.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
esp01s.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
esp01s.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
esp01s.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
esp01s.menu.wipe.none=Only Sketch
esp01s.menu.wipe.none.upload.erase_cmd=
esp01s.menu.wipe.sdk=Sketch + WiFi Settings
esp01s.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
esp01s.menu.wipe.all=All Flash Contents
esp01s.menu.wipe.all.upload.erase_cmd=erase_flash
esp01s.menu.baud.921600=921600
esp01s.menu.baud.921600.upload.speed=921600
esp01s.menu.baud.57600=57600
esp01s.menu.baud.57600.upload.speed=57600
esp01s.menu.baud.115200=115200
esp01s.menu.baud.115200.upload.speed=115200
esp01s.menu.baud.230400.linux=230400
esp01s.menu.baud.230400.macosx=230400
esp01s.menu.baud.230400.upload.speed=230400
esp01s.menu.baud.256000.windows=256000
esp01s.menu.baud.256000.upload.speed=256000
esp01s.menu.baud.460800.linux=460800
esp01s.menu.baud.460800.macosx=460800
esp01s.menu.baud.460800.upload.speed=460800
esp01s.menu.baud.512000.windows=512000
esp01s.menu.baud.512000.upload.speed=512000
esp01s.menu.baud.3000000=3000000
esp01s.menu.baud.3000000.upload.speed=3000000
##############################################################
generic.name=Generic ESP8266 Module
generic.build.board=ESP8266_GENERIC
generic.upload.tool=esptool
generic.upload.maximum_data_size=81920
generic.upload.wait_for_upload_port=true
generic.upload.erase_cmd=
generic.serial.disableDTR=true
generic.serial.disableRTS=true
generic.build.mcu=esp8266
generic.build.core=esp8266
generic.build.variant=generic
generic.build.spiffs_pagesize=256
generic.build.debug_port=
generic.build.debug_level=
generic.menu.xtal.80=80 MHz
generic.menu.xtal.80.build.f_cpu=80000000L
generic.menu.xtal.160=160 MHz
generic.menu.xtal.160.build.f_cpu=160000000L
generic.menu.vt.flash=Flash
generic.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
generic.menu.vt.heap=Heap
generic.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
generic.menu.vt.iram=IRAM
generic.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
generic.menu.exception.disabled=Disabled (new aborts on oom)
generic.menu.exception.disabled.build.exception_flags=-fno-exceptions
generic.menu.exception.disabled.build.stdcpp_lib=-lstdc++
generic.menu.exception.enabled=Enabled
generic.menu.exception.enabled.build.exception_flags=-fexceptions
generic.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
generic.menu.stacksmash.disabled=Disabled
generic.menu.stacksmash.disabled.build.stacksmash_flags=
generic.menu.stacksmash.enabled=Enabled
generic.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
generic.menu.ssl.all=All SSL ciphers (most compatible)
generic.menu.ssl.all.build.sslflags=
generic.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
generic.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
generic.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
generic.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
generic.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
generic.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
generic.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
generic.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
generic.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
generic.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
generic.menu.mmu.ext128k=128K Heap External 23LC1024
generic.menu.mmu.ext128k.build.mmuflags=-DMMU_EXTERNAL_HEAP=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
generic.menu.mmu.ext8192k=8M w/256K Heap External 64 MBit PSRAM
generic.menu.mmu.ext8192k.build.mmuflags=-DMMU_EXTERNAL_HEAP=256 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
generic.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
generic.menu.non32xfer.fast.build.non32xferflags=
generic.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
generic.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
generic.menu.ResetMethod.nodemcu=dtr (aka nodemcu)
generic.menu.ResetMethod.nodemcu.upload.resetmethod=--before default_reset --after hard_reset
generic.menu.ResetMethod.ck=no dtr (aka ck)
generic.menu.ResetMethod.ck.upload.resetmethod=--before no_reset --after soft_reset
generic.menu.ResetMethod.nodtr_nosync=no dtr, no_sync
generic.menu.ResetMethod.nodtr_nosync.upload.resetmethod=--before no_reset_no_sync --after soft_reset
generic.menu.CrystalFreq.26=26 MHz
generic.menu.CrystalFreq.40=40 MHz
generic.menu.CrystalFreq.40.build.extra_flags=-DF_CRYSTAL=40000000
generic.menu.FlashFreq.40=40MHz
generic.menu.FlashFreq.40.build.flash_freq=40
generic.menu.FlashFreq.80=80MHz
generic.menu.FlashFreq.80.build.flash_freq=80
generic.menu.FlashFreq.20=20MHz
generic.menu.FlashFreq.20.build.flash_freq=20
generic.menu.FlashFreq.26=26MHz
generic.menu.FlashFreq.26.build.flash_freq=26
generic.menu.FlashMode.dout=DOUT (compatible)
generic.menu.FlashMode.dout.build.flash_mode=dout
generic.menu.FlashMode.dout.build.flash_flags=-DFLASHMODE_DOUT
generic.menu.FlashMode.dio=DIO
generic.menu.FlashMode.dio.build.flash_mode=dio
