Gandalf20/ESP8266-3.1.2/esp8266/boards.txt
d1_mini.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
d1_mini.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
d1_mini.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
d1_mini.menu.wipe.none=Only Sketch
d1_mini.menu.wipe.none.upload.erase_cmd=
d1_mini.menu.wipe.sdk=Sketch + WiFi Settings
d1_mini.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
d1_mini.menu.wipe.all=All Flash Contents
d1_mini.menu.wipe.all.upload.erase_cmd=erase_flash
d1_mini.menu.baud.921600=921600
d1_mini.menu.baud.921600.upload.speed=921600
d1_mini.menu.baud.57600=57600
d1_mini.menu.baud.57600.upload.speed=57600
d1_mini.menu.baud.115200=115200
d1_mini.menu.baud.115200.upload.speed=115200
d1_mini.menu.baud.230400.linux=230400
d1_mini.menu.baud.230400.macosx=230400
d1_mini.menu.baud.230400.upload.speed=230400
d1_mini.menu.baud.256000.windows=256000
d1_mini.menu.baud.256000.upload.speed=256000
d1_mini.menu.baud.460800.linux=460800
d1_mini.menu.baud.460800.macosx=460800
d1_mini.menu.baud.460800.upload.speed=460800
d1_mini.menu.baud.512000.windows=512000
d1_mini.menu.baud.512000.upload.speed=512000
d1_mini.menu.baud.3000000=3000000
d1_mini.menu.baud.3000000.upload.speed=3000000
d1_mini.menu.eesz.autoflash=Mapping defined by Hardware and Sketch
d1_mini.menu.eesz.autoflash.build.flash_size=16M
d1_mini.menu.eesz.autoflash.build.flash_ld=eagle.flash.auto.ld
d1_mini.menu.eesz.autoflash.build.extra_flags=-DFLASH_MAP_SUPPORT=1
d1_mini.menu.eesz.autoflash.upload.maximum_size=1044464

##############################################################
d1_mini_clone.name=LOLIN(WEMOS) D1 mini (clone)
d1_mini_clone.build.board=ESP8266_WEMOS_D1MINI
d1_mini_clone.build.variant=d1_mini
d1_mini_clone.upload.tool=esptool
d1_mini_clone.upload.maximum_data_size=81920
d1_mini_clone.upload.wait_for_upload_port=true
d1_mini_clone.upload.erase_cmd=
d1_mini_clone.serial.disableDTR=true
d1_mini_clone.serial.disableRTS=true
d1_mini_clone.build.mcu=esp8266
d1_mini_clone.build.core=esp8266
d1_mini_clone.build.spiffs_pagesize=256
d1_mini_clone.build.debug_port=
d1_mini_clone.build.debug_level=
d1_mini_clone.menu.xtal.80=80 MHz
d1_mini_clone.menu.xtal.80.build.f_cpu=80000000L
d1_mini_clone.menu.xtal.160=160 MHz
d1_mini_clone.menu.xtal.160.build.f_cpu=160000000L
d1_mini_clone.menu.vt.flash=Flash
d1_mini_clone.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
d1_mini_clone.menu.vt.heap=Heap
d1_mini_clone.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
d1_mini_clone.menu.vt.iram=IRAM
d1_mini_clone.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
d1_mini_clone.menu.exception.disabled=Disabled (new aborts on oom)
d1_mini_clone.menu.exception.disabled.build.exception_flags=-fno-exceptions
d1_mini_clone.menu.exception.disabled.build.stdcpp_lib=-lstdc++
d1_mini_clone.menu.exception.enabled=Enabled
d1_mini_clone.menu.exception.enabled.build.exception_flags=-fexceptions
d1_mini_clone.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
d1_mini_clone.menu.stacksmash.disabled=Disabled
d1_mini_clone.menu.stacksmash.disabled.build.stacksmash_flags=
d1_mini_clone.menu.stacksmash.enabled=Enabled
d1_mini_clone.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
d1_mini_clone.menu.ssl.all=All SSL ciphers (most compatible)
d1_mini_clone.menu.ssl.all.build.sslflags=
d1_mini_clone.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
d1_mini_clone.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
d1_mini_clone.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
d1_mini_clone.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
d1_mini_clone.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
d1_mini_clone.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
d1_mini_clone.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
d1_mini_clone.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
d1_mini_clone.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
d1_mini_clone.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
d1_mini_clone.menu.mmu.ext128k=128K Heap External 23LC1024
d1_mini_clone.menu.mmu.ext128k.build.mmuflags=-DMMU_EXTERNAL_HEAP=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
d1_mini_clone.menu.mmu.ext8192k=8M w/256K Heap External 64 MBit PSRAM
d1_mini_clone.menu.mmu.ext8192k.build.mmuflags=-DMMU_EXTERNAL_HEAP=256 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
d1_mini_clone.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
d1_mini_clone.menu.non32xfer.fast.build.non32xferflags=
d1_mini_clone.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
d1_mini_clone.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
d1_mini_clone.upload.resetmethod=--before default_reset --after hard_reset
d1_mini_clone.menu.FlashMode.dout=DOUT (compatible)
d1_mini_clone.menu.FlashMode.dout.build.flash_mode=dout
d1_mini_clone.menu.FlashMode.dout.build.flash_flags=-DFLASHMODE_DOUT
d1_mini_clone.menu.FlashMode.dio=DIO
d1_mini_clone.menu.FlashMode.dio.build.flash_mode=dio
d1_mini_clone.menu.FlashMode.dio.build.flash_flags=-DFLASHMODE_DIO
d1_mini_clone.menu.FlashMode.qout=QOUT
d1_mini_clone.menu.FlashMode.qout.build.flash_mode=qout
d1_mini_clone.menu.FlashMode.qout.build.flash_flags=-DFLASHMODE_QOUT
d1_mini_clone.menu.FlashMode.qio=QIO (fast)
d1_mini_clone.menu.FlashMode.qio.build.flash_mode=qio
d1_mini_clone.menu.FlashMode.qio.build.flash_flags=-DFLASHMODE_QIO
d1_mini_clone.menu.FlashFreq.40=40MHz
d1_mini_clone.menu.FlashFreq.40.build.flash_freq=40
d1_mini_clone.menu.FlashFreq.80=80MHz
d1_mini_clone.menu.FlashFreq.80.build.flash_freq=80
d1_mini_clone.menu.FlashFreq.20=20MHz
d1_mini_clone.menu.FlashFreq.20.build.flash_freq=20
d1_mini_clone.menu.FlashFreq.26=26MHz
d1_mini_clone.menu.FlashFreq.26.build.flash_freq=26
d1_mini_clone.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
d1_mini_clone.menu.eesz.4M2M.build.flash_size=4M
d1_mini_clone.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
d1_mini_clone.menu.eesz.4M2M.build.spiffs_pagesize=256
d1_mini_clone.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
d1_mini_clone.menu.eesz.4M2M.build.spiffs_start=0x200000
d1_mini_clone.menu.eesz.4M2M.build.spiffs_end=0x3FA000
d1_mini_clone.menu.eesz.4M2M.build.spiffs_blocksize=8192
d1_mini_clone.menu.eesz.4M2M.build.eeprom_start=0x3FA000
d1_mini_clone.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
d1_mini_clone.menu.eesz.4M3M.build.flash_size=4M
d1_mini_clone.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
d1_mini_clone.menu.eesz.4M3M.build.spiffs_pagesize=256
d1_mini_clone.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
d1_mini_clone.menu.eesz.4M3M.build.spiffs_start=0x100000
d1_mini_clone.menu.eesz.4M3M.build.spiffs_end=0x3FA000
d1_mini_clone.menu.eesz.4M3M.build.spiffs_blocksize=8192
d1_mini_clone.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
d1_mini_clone.menu.eesz.4M1M.build.flash_size=4M
d1_mini_clone.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
d1_mini_clone.menu.eesz.4M1M.build.spiffs_pagesize=256
d1_mini_clone.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
d1_mini_clone.menu.eesz.4M1M.build.spiffs_start=0x300000
d1_mini_clone.menu.eesz.4M1M.build.spiffs_end=0x3FA000
d1_mini_clone.menu.eesz.4M1M.build.spiffs_blocksize=8192
d1_mini_clone.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
d1_mini_clone.menu.eesz.4M.build.flash_size=4M
d1_mini_clone.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
d1_mini_clone.menu.eesz.4M.build.spiffs_pagesize=256
d1_mini_clone.menu.eesz.4M.build.rfcal_addr=0x3FC000
d1_mini_clone.menu.ip.lm2f=v2 Lower Memory
d1_mini_clone.menu.ip.lm2f.build.lwip_include=lwip2/include
d1_mini_clone.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
d1_mini_clone.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
d1_mini_clone.menu.ip.hb2f=v2 Higher Bandwidth
d1_mini_clone.menu.ip.hb2f.build.lwip_include=lwip2/include
d1_mini_clone.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
d1_mini_clone.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
d1_mini_clone.menu.ip.lm2n=v2 Lower Memory (no features)
d1_mini_clone.menu.ip.lm2n.build.lwip_include=lwip2/include
d1_mini_clone.menu.ip.lm2n.build.lwip_lib=-llwip2-536
d1_mini_clone.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
d1_mini_clone.menu.ip.hb2n=v2 Higher Bandwidth (no features)
d1_mini_clone.menu.ip.hb2n.build.lwip_include=lwip2/include
d1_mini_clone.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
d1_mini_clone.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
d1_mini_clone.menu.ip.lm6f=v2 IPv6 Lower Memory
d1_mini_clone.menu.ip.lm6f.build.lwip_include=lwip2/include
d1_mini_clone.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
d1_mini_clone.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
d1_mini_clone.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
d1_mini_clone.menu.ip.hb6f.build.lwip_include=lwip2/include
d1_mini_clone.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
d1_mini_clone.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
d1_mini_clone.menu.dbg.Disabled=Disabled
d1_mini_clone.menu.dbg.Disabled.build.debug_port=
d1_mini_clone.menu.dbg.Serial=Serial
d1_mini_clone.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
d1_mini_clone.menu.dbg.Serial1=Serial1
d1_mini_clone.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
d1_mini_clone.menu.lvl.None____=None
d1_mini_clone.menu.lvl.None____.build.debug_level=
d1_mini_clone.menu.lvl.SSL=SSL
d1_mini_clone.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
d1_mini_clone.menu.lvl.TLS_MEM=TLS_MEM
d1_mini_clone.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
d1_mini_clone.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
d1_mini_clone.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
d1_mini_clone.menu.lvl.HTTP_SERVER=HTTP_SERVER
d1_mini_clone.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
d1_mini_clone.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
d1_mini_clone.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
d1_mini_clone.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
d1_mini_clone.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
d1_mini_clone.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
d1_mini_clone.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
d1_mini_clone.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
d1_mini_clone.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
d1_mini_clone.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
d1_mini_clone.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
d1_mini_clone.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
d1_mini_clone.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini_clone.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
d1_mini_clone.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
d1_mini_clone.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
d1_mini_clone.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
d1_mini_clone.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
d1_mini_clone.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini_clone.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
d1_mini_clone.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini_clone.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
d1_mini_clone.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini_clone.menu.lvl.CORE=CORE
d1_mini_clone.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
d1_mini_clone.menu.lvl.WIFI=WIFI
d1_mini_clone.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
d1_mini_clone.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
d1_mini_clone.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
d1_mini_clone.menu.lvl.UPDATER=UPDATER
d1_mini_clone.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
d1_mini_clone.menu.lvl.OTA=OTA
d1_mini_clone.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
d1_mini_clone.menu.lvl.OOM=OOM
d1_mini_clone.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
d1_mini_clone.menu.lvl.MDNS=MDNS
d1_mini_clone.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
d1_mini_clone.menu.lvl.HWDT=HWDT
d1_mini_clone.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
d1_mini_clone.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
d1_mini_clone.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
d1_mini_clone.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
d1_mini_clone.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
d1_mini_clone.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
d1_mini_clone.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
d1_mini_clone.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
d1_mini_clone.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
d1_mini_clone.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
d1_mini_clone.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
d1_mini_clone.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
d1_mini_clone.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
d1_mini_clone.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
d1_mini_clone.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
d1_mini_clone.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
d1_mini_clone.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
d1_mini_clone.menu.wipe.none=Only Sketch
d1_mini_clone.menu.wipe.none.upload.erase_cmd=
d1_mini_clone.menu.wipe.sdk=Sketch + WiFi Settings
d1_mini_clone.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
d1_mini_clone.menu.wipe.all=All Flash Contents
d1_mini_clone.menu.wipe.all.upload.erase_cmd=erase_flash
d1_mini_clone.menu.baud.921600=921600
d1_mini_clone.menu.baud.921600.upload.speed=921600
d1_mini_clone.menu.baud.57600=57600
d1_mini_clone.menu.baud.57600.upload.speed=57600
d1_mini_clone.menu.baud.115200=115200
d1_mini_clone.menu.baud.115200.upload.speed=115200
d1_mini_clone.menu.baud.230400.linux=230400
d1_mini_clone.menu.baud.230400.macosx=230400
d1_mini_clone.menu.baud.230400.upload.speed=230400
d1_mini_clone.menu.baud.256000.windows=256000
d1_mini_clone.menu.baud.256000.upload.speed=256000
d1_mini_clone.menu.baud.460800.linux=460800
d1_mini_clone.menu.baud.460800.macosx=460800
d1_mini_clone.menu.baud.460800.upload.speed=460800
d1_mini_clone.menu.baud.512000.windows=512000
d1_mini_clone.menu.baud.512000.upload.speed=512000
d1_mini_clone.menu.baud.3000000=3000000
d1_mini_clone.menu.baud.3000000.upload.speed=3000000
d1_mini_clone.menu.eesz.autoflash=Mapping defined by Hardware and Sketch
d1_mini_clone.menu.eesz.autoflash.build.flash_size=16M
d1_mini_clone.menu.eesz.autoflash.build.flash_ld=eagle.flash.auto.ld
d1_mini_clone.menu.eesz.autoflash.build.extra_flags=-DFLASH_MAP_SUPPORT=1
d1_mini_clone.menu.eesz.autoflash.upload.maximum_size=1044464

